benchmark/results/rocket_json.txt
Bombarding http://rocket:8000/json for 10s using 125 connection(s)



 00m09s
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     19073.33    5772.82   32330.29
  Latency        6.55ms     5.72ms      2.03s
  HTTP codes:
    1xx - 0, 2xx - 190456, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     5.73MB/s