benchmark/results/rocket_json.txt
Bombarding http://127.0.0.1:8004/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    107814.24    5834.04  122203.88
  Latency        1.16ms   414.59us    15.52ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1078031
  Errors:
    dial tcp 127.0.0.1:8004: connect: connection refused - 1078031
  Throughput:       0.00/s