benchmark/results/rocket_plaintext.txt
Bombarding http://127.0.0.1:8004/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    107913.46    6448.13  120151.16
  Latency        1.15ms   386.31us    15.04ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 1078944
  Errors:
    dial tcp 127.0.0.1:8004: connect: connection refused - 1078944
  Throughput:       0.00/s