benchmark/results/rocket_plaintext.txt
Bombarding http://rocket:8000/ for 10s using 125 connection(s)



 00m09s
 00m09s
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     16382.96    7604.99   61818.53
  Latency        7.68ms     5.21ms      1.17s
  HTTP codes:
    1xx - 0, 2xx - 162459, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     4.75MB/s