benchmark/results/rullst_json.txt
Bombarding http://rullst:3000/json for 10s using 125 connection(s)



 00m09s
 00m08s
 00m08s
 00m08s
[...]
 00m07s
 00m07s
 00m07s
[...]
 00m06s
 00m06s
 00m06s
[...]
 00m05s
 00m05s
 00m05s
[...]
 00m04s
 00m04s
 00m04s
[...]
 00m03s
 00m03s
 00m03s
[...]
 00m02s
 00m02s
 00m02s
[...]
 00m01s
 00m01s
 00m01s
[...]



 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     10847.17    3722.53   24457.47
  Latency       11.58ms     5.59ms   117.64ms
  HTTP codes:
    1xx - 0, 2xx - 107580, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     6.66MB/s