benchmark/results/rullst_json.txt
Bombarding http://127.0.0.1:3000/json for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     74393.31   15752.11   97737.86
  Latency        1.68ms     1.97ms    72.07ms
  HTTP codes:
    1xx - 0, 2xx - 618714, 3xx - 0, 4xx - 0, 5xx - 0
    others - 125214
  Errors:
    dial tcp 127.0.0.1:3000: connect: connection refused - 125214
  Throughput:    11.86MB/s