benchmark/results/rullst_plaintext.txt
Bombarding http://127.0.0.1:3000/ for 10s using 125 connection(s)
[==========================================================================] 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec     38426.60   17512.05  297619.05
  Latency        3.30ms     7.04ms    91.44ms
  HTTP codes:
    1xx - 0, 2xx - 0, 3xx - 0, 4xx - 0, 5xx - 0
    others - 375196
  Errors:
    dial tcp 127.0.0.1:3000: connect: connection refused - 375196
  Throughput:       0.00/s